/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */

public class Task_1_4 {
    public static void main(String[] args) {
        int number = 25;
        System.out.println(number * number);
    }
}
